# CannotDrawSingularSlantedWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotDrawSingularSlantedWall Property
BuiltInFailures..::..CreationFailures Class See Also
---
Cannot create wall - it would intersect itself. Reduce the wall's height or slant.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawSingularSlantedWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawSingularSlantedWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawSingularSlantedWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace